[
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
      "cost": "$420",
      "duration": "8 months",
      "category_id": "01",
      "rating": { "number": 4.8, "badge": "Excellent" },
      "total_view": 488,
      "title": "Python for Everybody Specialization",
      "image_url": "https://s3.amazonaws.com/coursera_assets/meta_images/generated/XDP/XDP~SPECIALIZATION!~python/XDP~SPECIALIZATION!~python.jpeg",
      "details": "Designed to help anyone navigate the complexities of the Python programming language, the “Python for Everybody” specialization is a comprehensive entryway for beginners.If you want to become a Python programmer, but don’t have a lot of background in coding, this is the course for you. The first two courses are suitable for people with no prior knowledge at all.The “specialization” course builds on the success of the initial “Python for Everybody” course to introduce new learning outcomes, like creating your own applications for data processing."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
      "cost": "$156",
      "duration": "4 months",
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Google IT Automation with Python",
      "image_url": "https://149357281.v2.pressablecdn.com/wp-content/uploads/2020/01/Blog-1200x630-1-1024x538.png",
      "details": "Covering not just Python programming tips, but also insights into IT automation, and Git, the Google IT Automation with Python, is a convenient way to kickstart your technology career.This beginner-level course doesn’t require any previous programming knowledge. Basic knowledge of IT concepts like data management and operating systems is all you need to get started.The course aims to provide digital enthusiasts with the tools they need to advance their IT careers and comes with a Google professional certification to enhance your resume."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6c",
      "cost": "$94",
      "duration": "22 hours",
      "category_id": "01",
      "rating": { "number": 4.0, "badge": "Excellent" },
      "total_view": 488,
      "title": "Complete Python Bootcamp",
      "image_url": "https://i.ytimg.com/vi/uQ5A0owPFk0/maxresdefault.jpg",
      "details": "Every programmer needs to start somewhere. If you’re looking for the best Python course for beginners, the Complete Python Bootcamp offers a fantastic introduction to this powerful programming language.Covering everything you need to know to use Python professionally, the Bootcamp requires no prior knowledge, just an internet connection, and a computer.The comprehensive, yet straightforward course includes more than 100 lectures and 21 hours of video to take you from the absolute ground floor in programming, to coding excellence."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6d",
      "cost": "$94",
      "duration": "22 hours",
      "category_id": "01",
      "rating": { "number": 4.3, "badge": "Excellent" },
      "total_view": 488,
      "title": "Python Fundamentals",
      "image_url": "https://s3-us-west-2.amazonaws.com/cdn.w3grads.com/web/services/115/original/PythonIntroMP4FullHD.mp4_snapshot_00.20.000.jpg",
      "details": "Great for people with no prior knowledge of Python programming, the “Fundamentals”, course introduces you to everything you need to know about coding with Python.Robert Smallshire, and Austin Bingham of Sixty North provide a simple and easy-to-follow introduction into what Python can do, and how programmers can leverage the language.This course aims to make even the most complex aspects of Python fun and engaging, guiding you through all kinds of components, from strings and collections to objects and modularity."
    },

    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6e",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Computing in Python I: Fundamentals and Procedural Programming",
      "image_url": "https://education.sakshi.com/sites/default/files/2021-10/computing_in_python.jpg",
      "details": "Starting from the beginning and covering all the basics of coding, how to write programs, and evaluate their output, Computing in Python is a comprehensive learning experience.The course, split into a series of easy-to-understand modules, combines an introduction to Python with a comprehensive view of the fundamentals of computing and programming.David Joyner from the Georgia Institute of Technology makes complex topics easy to digest with straightforward explanations, so you don’t need any in-depth coding knowledge. Basic knowledge of algebra will come in handy, however."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6f",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Python for Beginners",
      "image_url": "https://miro.medium.com/max/1400/1*Zipt5ex6sSVSkciwlJoG4Q.png",
      "details": "Great for hands-on learners, the Python for Beginners course allows students to dive straight into the Python landscape, experimenting with building new tools using variables, data types, and expressions. You’ll access guided exercises to help you discover how to use various functions and collections in an easy-to-follow format.This course experience, distributed over a series of 8 projects, is ideal if you don’t want to wait weeks before diving into programming. You learn just enough to start using code yourself, then develop your knowledge through experience."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6g",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Python Quick Start",
      "image_url": "https://statanalytica.com/blog/wp-content/uploads/2022/02/difference-between-python-2-and-3-1024x536.png",
      "details": "Python Quick Start is a beginner-focused course designed to give users a quick introduction to Python and the nature of this dynamic programming language.You don’t need any existing knowledge to get started, and you’ll even get an official LinkedIn learning Python certificate at the end of the course to add to your resume and make yourself stand out.This training option is likely to be one of the best Python courses if you want a quick introduction to the language, rather than a comprehensive bootcamp."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6h",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Object-Oriented Programming in Java Specialization by Coursera ",
      "image_url": "https://s3.amazonaws.com/coursera_assets/meta_images/generated/XDP/XDP~SPECIALIZATION!~object-oriented-programming/XDP~SPECIALIZATION!~object-oriented-programming.jpeg ",
      "details": "Coursera has introduced this new course specifically for intermediate to expert level attendees. This program is for those software developers who have experience in programming languages such as Python, C, JavaScript, and more. Object-oriented programming in Java Specialization helps in solving complex problems through object-oriented design knowledge sharing to the attendees. In addition to that, the two Java development environments that are BlueJ and Eclipse, are also introduced, which will help the attendees to gain knowledge of graphical user interfaces so that they can easily design "
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6i",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "The Complete Java Masterclass by Udemy",
      "image_url": "https://www.best-course-online.com/wp-content/uploads/533682-udemy-coupon-review.jpg",
      "details": "The complete Java Masterclass is the most popular course, with more than 210,000 students enrolled to date. Udemy offers the course, and the classes are taken by Time Buchalka, a well-reputed and globally renowned Java developer and teacher. This course has accomplished 4.6 ratings which reveal the quality of knowledge sharing made by the faculties. The course is top-rated on the web platform and has more than 40K likes and sharing. This course has also observed updates from Java 8 to Have 9 to make them beneficial for the attendees."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6j",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Java Programming: Solving Problems with Software by Coursera",
      "image_url": "https://s3.amazonaws.com/coursera_assets/meta_images/generated/XDP/XDP~COURSE!~java-programming/XDP~COURSE!~java-programming.jpeg",
      "details": "Coursera has introduced the course, namely Solving problems with software, to deliver education in learning to code in Java so that the programming and problem-solving skills can be added to the attendees. This program is ideal for the expert level and intermediate attendees who are looking to improve their skills in problem-solving in the Java language. Also, this program intends to deliver knowledge on design algorithms and develop and debug programs accordingly."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6k",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Java Fundamentals by Pluralsight",
      "image_url": "https://pluralsight.imgix.net/course-images/test-automation-java-fundamentals-v1.png",
      "details": "Pluralsight has introduced one of the best Java courses for beginners, which is meant to deliver Java language knowledge right from basics to core level concepts. Jim Wilson, a software engineer and has more than thirty years of experience in this field, takes the class and delivers valuable knowledge to the attendees. This course covers the basics of Java, Class, Files, error handling, data types, object, and other core Java concepts. In addition to that, this course offers detailed information about Java Programming language and servers. This will help the attendees to gain the most required information to get jobs and apply the server-side and client-side developments."
    },
  
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6l",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "C++: From Beginner to Expert",
      "image_url": "https://hopeconflict.com/images/course/1634976013PicsArt_10-23-01.23.28.jpg",
      "details": "Save your precious time by buying this course. You will learn how to program in C++ in a fast and easy way! The total length of the course is over 17 hours! You will learn theory and you will also gain lots of practice. During the course we will write many programs that will make you a great programmer.All of this is presented by a young man who shares his knowledge, so the language used can be easily understood by everyone.  "
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6m",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Learn Advanced C++ Programming",
      "image_url": "https://i.ytimg.com/vi/mUQZ1qmKlLY/maxresdefault.jpg",
      "details": "This course will take you from a basic knowledge of C++ to using more advanced features of the language. This course is for you if you want to deepen your basic knowledge of C++, you want to learn C++ 11 features, or you've taken my free beginners' C++ course and you're looking for the next step.We'll start with a look at C++ file handling and move through STL, template classes, operator overloading, lambda expressions, move constructors and much more besides.At the end of the course I'll show you how to create a program that generates fractal images, using a a few of the language features we've seen in the course and giving you a great work out with smart pointers and arrays."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6o",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Design Patterns in Modern C++",
      "image_url": "https://reviewsreporter.com/wp-content/uploads/2022/08/CPlusPlus1.jpg",
      "details": "This course provides a comprehensive overview of Design Patterns in Modern C++ from a practical perspective. This course in particular covers patterns with the use of:The latest versions of the C++ programming language Use of modern programming approaches: dependency injection, use of coroutines, and more! Use of modern developer tools such as CLion and ReSharper C++ Discussions of pattern variations and alternative approaches"
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6p",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "C Programming For Beginners",
      "image_url": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20200717144410/Learn-C-Programming-for-Beginners-A-20-Day-Curriculum.png",
      "details": "The fastest, easiest way to learn to program C on a Mac or Windows. This course will teach you to program the C language from the ground up. You will learn everything from the very fundamentals of programming right through to the complexities of pointers, addresses and File IO. Maybe you've tried to master C before but failed. Or maybe you are new to C or new to programming. If so, this is the course for you! C is one of the most important of all programming languages. It is used to program desktop applications, compilers, tools and utilities and even hardware devices. The C language is fast and efficient – but it can be hard to learn. Unless you use this course. This course begins with a gentle introduction to C but quickly moves on to explain some of its most confusing features: everything from C's 'scoping' rules to the curious connection between arrays and memory addresses. By the end of the course you will have a deep understanding both of the C language itself and also of the underlying 'architecture' of your computer."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6q",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "C Programming Step by Step - Complete Tutorial For Beginners",
      "image_url": "https://d1m75rqqgidzqn.cloudfront.net/wp-data/2022/02/05230444/Learn-C-Programming-Online-Free.jpg",
      "details": "I have been teaching this course to the undergraduate engineering students for last 15 years in class room. This course is well designed and covered almost all the topics that one should know while learning C language. Will not only help the student to build a solid foundation on the topic but will boost their confidence to face technical interviews boldly. The course contents are mostly video lectures. I would encourage absolute beginners to follow the lectures strictly in chronological manners, please start from the very first video and go to the next one only if you are done with the previous. However, though not recommended, but students with some previous knowledge could jump lectures if they are confident. The course is structured basically for the new programmers who may not have any previous experience with any programming language. From the very basic to advanced topics. Simple program to complex one in step-by-step. One should take this course to build a career as a programmer. Programming in C has been considered as foundation for any programming language. If one is confident with C, then can start learning any other language like PHP, C++ or Java."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6r",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Advanced C Programming Course",
      "image_url": "https://cc.sj-cdn.net/instructor/kt1ejklh2ngf-microchip-technology/courses/1ml1xnfafd0fx/promo-image.1631742727.png ",
      "details": "The C programming language in 2020 is still one of the most popular and widely used languages. Having C programming skills gives you great career options, but learning the C language, particularly some of the trickier advanced stuff can be really difficult. This course is designed to take your basic C skills to the next level and help you obtain mastery of the language by helping you understand advanced concepts of the C programming language, enabling you to master the art of problem-solving in programming using efficient, proven methods. You’ll learn how to write high-quality C code and to make yourself more marketable for higher-level programming positions. Just some of the topics in this huge 28-hour course include Threads, Function Pointers, Double Pointers, Recursion, Networking using Sockets, Bit manipulation, Macros, Signals, Storage Classes and loads more.  Check the curriculum on this page for full details of what is included in this very comprehensive course."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6s",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "C PROGRAMMING made easy",
      "image_url": "http://d1jnx9ba8s6j9r.cloudfront.net/blog/wp-content/uploads/2019/08/C-Programming-Tutorial-1.jpg",
      "details": "This course is designed for students / professionals who are relatively to new (or) beginners to programming. This course is designed to give hands-on programming knowledge in various concepts of C-Language. Below concepts are covered with illustrated code samples. All code samples can be reviewed and practiced."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6t",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Become a Certified HTML, CSS, JavaScript Web Developer",
      "image_url": "https://d3f1iyfxxz8i1e.cloudfront.net/courses/course_image/a4b6c9234865.jpg",
      "details": "Learn What It Takes to Code Dynamic, Professional Websites and Web Apps From The Comfort of Your Own Home  Do you ever browse the internet wondering how your favorite websites were built? Facebook, Twitter, Amazon—they were all created by people who at one point in time didn’t know anything about coding. How did they obtain this knowledge? In this comprehensive course, I’m going to show you everything you need to know so that you can follow in these people’s footsteps. You’re going to learn how to code AND you’re going to become a certified professional from a recognized international trainer. And best of all, you’re going to have fun doing it. You Don’t Have to Be a Genius or a Mathematical Wizard. So many people believe that you must have a special ‘gift’ to create professional-quality, dynamic websites/web apps. I’m here to tell you once and for all that this is false. All you need to have is the desire to learn and the ability to follow instructions—that’s it! "
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6w",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "The Complete 2022 Fullstack Web Developer Course",
      "image_url": "https://www.spaceo.ca/wp-content/uploads/2021/08/Full-Stack-Development-Courses-1.jpg ",
      "details": "This was the first Complete Web Development course on Udemy. It's extremely comprehensive and I explain EVERYTHING you need to know, step by step. There's a reason why there are so many Complete Web Development courses on Udemy today -- they took what worked and made spin off courses.Join over 80,000 other students in this massive course! This course is designed for every skill level. Whether you're just learning web development today, or you're already a Python Pro, there's lots to learn for everybody! "
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6x",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Introduction to Web Development",
      "image_url": "https://www.relinns.com/wp-content/uploads/2018/07/91blog.png",
      "details": "Are you considering web development as a career? Do you simply want to learn to create your own web sites but don't know where to start? Does the world of programming fascinate you? Are you curious about what it takes to be a web developer. Join master instructor, Mark Lassoff, for this fast paced, short course designed to introduce you to the world of web development. You'll be introduced to three of the primary languages used for web development."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6y",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Running a Web Development Business: The Complete Guide",
      "image_url": "https://s3.amazonaws.com/www.starterstory.com/stories/social_shares/000/006/061/original/open-uri20210513-4-1jvtxh7?1620900680",
      "details": "Web development is one of the fastest growing online industries today. It's important for every business to have an online presence and that represents a huge opportunity for you. Whether you want to code or not, you can capitalize on the over 24 billion dollars of money spent per year on web development services. Whether you want to work part-time or full-time, you can create an awesome portfolio and an even better income taking on web development projects. In this course, I'm going to show you how to jumpstart your business, grow it quickly, and manage your business like a professional - all from the comfort of your laptop."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab7a",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "PHP Web Development with MySQL",
      "image_url": "https://ishanacharya.files.wordpress.com/2021/03/web-development-with-php-mysql-cakephp.png?w=470",
      "details": "The students can be able to create web applications using PHP and MySQL The students can be able to understand the concepts of client and server. The students get hands on experience of how things happen in PHP? The students get in depth learning of MySQL relational database management system. "
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab7b",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "The Complete Object Oriented PHP Developer Course",
      "image_url": "https://s3.amazonaws.com/coursera_assets/meta_images/generated/XDP/XDP~COURSE!~oop-with-php/XDP~COURSE!~oop-with-php.jpeg",
      "details": "Modern object oriented programming principles and practice PHP 7.4 and greater (currently at version 8) Latest technology and techniques Using 3rd party packages"
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab7v",
      "cost": "$149",
      "duration": "5 weeks",
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "PHP for Beginners : Learn PHP Programming From Scratch!",
      "image_url": "https://i.ytimg.com/vi/4PfUtr2x9z8/maxresdefault.jpg",
      "details": "Write PHP codes easily Understand PHP and Web Terminology Create Your Own PHP Pages! Catch the Opportunities in the Web Development!"
    }
  

























  ]